maxjchuang/xiaozhi-esp32-music/main/boards/espressif/esp-vocat/esp_vocat.cc
    Charge(i2c_master_bus_handle_t i2c_bus, uint8_t addr) : I2cDevice(i2c_bus, addr) {
        read_buffer_ = new uint8_t[8];
    }
    ~Charge() { delete[] read_buffer_; }

    int16_t ReadWord(uint8_t reg) {
        uint8_t data[2] = {0};
        ReadRegs(reg, data, 2);
        return static_cast<int16_t>(static_cast<uint16_t>(data[0]) |
                                    (static_cast<uint16_t>(data[1]) << 8));
    }

    int GetBatteryLevel() {
        int level = ReadWord(kRegStateOfCharge);
        if (level < 0) {
            return 0;
        }
        if (level > 100) {
            return 100;
        }
        return level;
    }

    bool IsCharging() {
        const uint16_t status = static_cast<uint16_t>(ReadWord(kRegBatteryStatus));
        if ((status & kBatteryStatusDsg) == 0) {
            return true;
        }

        const int16_t avg_current_ma = ReadWord(kRegAverageCurrent);
        const int16_t current_ma = ReadWord(kRegCurrent);
        // Current is a fallback only: AverageCurrent can lag charger insertion noticeably.
        return avg_current_ma > kChargingCurrentMa || current_ma > kChargingCurrentMa;
    }

    bool IsDischarging() {
        return (static_cast<uint16_t>(ReadWord(kRegBatteryStatus)) & kBatteryStatusDsg) != 0;
    }

    void Update() {
        const int16_t voltage = ReadWord(kRegVoltage);
        const int16_t current = ReadWord(kRegCurrent);
        ESP_ERROR_CHECK(temperature_sensor_get_celsius(temp_sensor, &tsens_value));
        (void)voltage;
        (void)current;
    }

private:
    uint8_t* read_buffer_ = nullptr;
};

class Cst816s : public I2cDevice {
public:
    struct TouchPoint_t {
        int num = 0;
        int x = -1;
        int y = -1;
    };

    enum TouchEvent { TOUCH_NONE, TOUCH_PRESS, TOUCH_RELEASE, TOUCH_HOLD };

    Cst816s(i2c_master_bus_handle_t i2c_bus, uint8_t addr) : I2cDevice(i2c_bus, addr) {
        read_buffer_ = new uint8_t[6];
        was_touched_ = false;
        press_count_ = 0;

        // Create touch interrupt semaphore
        touch_isr_mux_ = xSemaphoreCreateBinary();
        if (touch_isr_mux_ == NULL) {
            ESP_LOGE(TAG, "Failed to create touch semaphore");
        }
    }

    ~Cst816s() {
        delete[] read_buffer_;

        // Delete semaphore if it exists
        if (touch_isr_mux_ != NULL) {
            vSemaphoreDelete(touch_isr_mux_);
            touch_isr_mux_ = NULL;
        }
    }

    void UpdateTouchPoint() {
        ReadRegs(0x02, read_buffer_, 6);
        tp_.num = read_buffer_[0] & 0x0F;
        tp_.x = ((read_buffer_[1] & 0x0F) << 8) | read_buffer_[2];
        tp_.y = ((read_buffer_[3] & 0x0F) << 8) | read_buffer_[4];
    }

    const TouchPoint_t& GetTouchPoint() { return tp_; }

    TouchEvent CheckTouchEvent() {
        bool is_touched = (tp_.num > 0);
        TouchEvent event = TOUCH_NONE;

        if (is_touched && !was_touched_) {
            // Press event (transition from not touched to touched)
            press_count_++;
            event = TOUCH_PRESS;
            ESP_LOGI(TAG, "TOUCH PRESS - count: %d, x: %d, y: %d", press_count_, tp_.x, tp_.y);
        } else if (!is_touched && was_touched_) {
            // Release event (transition from touched to not touched)
            event = TOUCH_RELEASE;
            ESP_LOGI(TAG, "TOUCH RELEASE - total presses: %d", press_count_);
        } else if (is_touched && was_touched_) {
            // Continuous touch (hold)
            event = TOUCH_HOLD;
            ESP_LOGD(TAG, "TOUCH HOLD - x: %d, y: %d", tp_.x, tp_.y);
        }

        // Update previous state
        was_touched_ = is_touched;
        return event;
    }

    int GetPressCount() const { return press_count_; }

    void ResetPressCount() { press_count_ = 0; }

    // Semaphore management methods
    SemaphoreHandle_t GetTouchSemaphore() { return touch_isr_mux_; }

    bool WaitForTouchEvent(TickType_t timeout = portMAX_DELAY) {
        if (touch_isr_mux_ != NULL) {
            return xSemaphoreTake(touch_isr_mux_, timeout) == pdTRUE;
        }
        return false;
    }

    void NotifyTouchEvent() {
        if (touch_isr_mux_ != NULL) {
            BaseType_t xHigherPriorityTaskWoken = pdFALSE;
            xSemaphoreGiveFromISR(touch_isr_mux_, &xHigherPriorityTaskWoken);
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        }
    }

private:
    uint8_t* read_buffer_ = nullptr;
    TouchPoint_t tp_;

    // Touch state tracking
    bool was_touched_;
    int press_count_;

    // Touch interrupt semaphore
    SemaphoreHandle_t touch_isr_mux_;
};

class EspVocat : public WifiBoard {
private:
    i2c_master_bus_handle_t i2c_bus_;
    i2c_bus_handle_t shared_i2c_bus_handle_ = nullptr;
    Cst816s* cst816s_;
    Charge* charge_;
    Button boot_button_;
    Display* display_ = nullptr;
    Esp32Music music_;
    PwmBacklight* backlight_ = nullptr;
    esp_timer_handle_t touchpad_timer_;
    esp_lcd_touch_handle_t tp;  // LCD touch handle
    EspVideo* camera_ = nullptr;
    TaskHandle_t charge_task_handle_ = nullptr;
    TaskHandle_t touch_task_handle_ = nullptr;
    TaskHandle_t imu_task_handle_ = nullptr;
#if ESP_VOCAT_ENABLE_CAP_TOUCH_SENSOR
    TaskHandle_t touch_slider_task_handle_ = nullptr;
#endif
    esp_timer_handle_t emotion_reset_timer_ = nullptr;
    bool bmi270_ready_ = false;
    bool was_charging_ = false;
    uint8_t low_battery_alert_mask_ = 0;
    int low_battery_plays_left_ = 0;
    int64_t next_low_battery_play_ms_ = 0;
#if ESP_VOCAT_ENABLE_CAP_TOUCH_SENSOR
    touch_slider_handle_t touch_slider_handle_ = nullptr;
    touch_button_handle_t touch_button_handle_ = nullptr;
#endif

    static bool IsPrivateIpv4(const std::string& address) {
        int octets[4] = {};
        size_t start = 0;
        for (size_t index = 0; index < 4; ++index) {
            const auto end = index == 3 ? address.size() : address.find('.', start);
            if (end == std::string::npos || end <= start || end - start > 3)
                return false;
            int value = 0;
            for (size_t cursor = start; cursor < end; ++cursor) {
                const unsigned char ch = address[cursor];
                if (!std::isdigit(ch))
                    return false;
                value = value * 10 + ch - '0';
            }
            if (value > 255)
                return false;
            octets[index] = value;
            start = end + 1;
        }
        return octets[0] == 10 || (octets[0] == 172 && octets[1] >= 16 && octets[1] <= 31) ||
               (octets[0] == 192 && octets[1] == 168);
    }

    static bool IsProxyUrl(const std::string& url, const std::string& resource) {
        constexpr std::string_view prefix = "http://";
        constexpr std::string_view marker = ":8765/media/";
        if (url.size() > 2048 || url.compare(0, prefix.size(), prefix) != 0)
            return false;
        const auto marker_pos = url.find(marker, prefix.size());
        if (marker_pos == std::string::npos)
            return false;
        const std::string resource_suffix = "/" + resource;
        const auto resource_pos = url.find(resource_suffix, marker_pos + marker.size());
        if (resource_pos == std::string::npos ||
            resource_pos + resource_suffix.size() != url.size())
            return false;
        const auto token =
            url.substr(marker_pos + marker.size(), resource_pos - marker_pos - marker.size());
        if (token.size() < 16 || token.size() > 128 ||
            !std::all_of(token.begin(), token.end(), [](unsigned char ch) {
                return std::isalnum(ch) || ch == '-' || ch == '_';
            }))
            return false;
        return IsPrivateIpv4(url.substr(prefix.size(), marker_pos - prefix.size()));
    }

    static bool IsApprovedAudioUrl(const std::string& url) {
        constexpr std::string_view official = "https://dl.espressif.com/";
        bool approved = url.compare(0, official.size(), official) == 0 || IsProxyUrl(url, "audio");
        return approved && std::none_of(url.begin(), url.end(),
                                        [](unsigned char ch) { return ch < 0x20 || ch == 0x7f; });
    }

    void InitializeTools() {
        auto& server = McpServer::GetInstance();
        server.AddTool(
            "self.online_music.play_music",
            "播放本机音乐 MCP 返回的 MP3。参数 url 是音频地址，url_song_name 是歌名，"
            "metadata_url 是可选清单地址。调用成功后简短告知用户已开始播放。",
            PropertyList(
                {Property("play_type", kPropertyTypeString, "url"),
                 Property("url", kPropertyTypeString).SetMaxLength(2048),
                 Property("url_song_name", kPropertyTypeString).SetMaxLength(192),
                 Property("metadata_url", kPropertyTypeString, std::string()).SetMaxLength(2048)}),
            [this](const PropertyList& properties) -> ToolResult {
                auto play_type = properties["play_type"].value<std::string>();
                auto url = properties["url"].value<std::string>();
                auto name = properties["url_song_name"].value<std::string>();
                auto manifest = properties["metadata_url"].value<std::string>();
                std::transform(play_type.begin(), play_type.end(), play_type.begin(),
                               [](unsigned char ch) { return std::tolower(ch); });
                if (play_type != "url")
                    return std::unexpected("play_type must be url");
                if (!IsApprovedAudioUrl(url))
                    return std::unexpected("audio URL is not approved");
                if (!manifest.empty() && !IsProxyUrl(manifest, "manifest.json"))
                    return std::unexpected("metadata URL is invalid");
                if (!music_.Play({url, name, manifest}))
                    return std::unexpected("failed to start MP3 playback");
                return std::string("{\"success\":true,\"message\":\"音频开始播放\"}");
            });
        server.AddTool(
            "self.online_music.stop_music",
            "立即停止当前音乐。用户说停止、暂停或别放了时直接调用。", PropertyList(),
            [this](const PropertyList&) -> ReturnValue {
                const bool active = music_.RequestStop();
                return active
                           ? std::string("{\"success\":true,\"message\":\"音乐已停止\"}")
                           : std::string("{\"success\":true,\"message\":\"当前没有音乐在播放\"}");
            });
    }

    static void emotion_reset_timer_callback(void* arg) {
        auto* self = static_cast<EspVocat*>(arg);
        if (self && self->display_ != nullptr) {
            self->display_->SetEmotion("neutral");
        }
    }

    void ShowTemporaryEmotion(const char* emotion, uint32_t duration_ms) {
        if (display_ == nullptr || emotion == nullptr) {
            return;
        }
        display_->SetEmotion(emotion);
        if (emotion_reset_timer_ != nullptr) {
            esp_timer_stop(emotion_reset_timer_);
            esp_timer_start_once(emotion_reset_timer_,
                                 static_cast<uint64_t>(duration_ms) * 1000ULL);
        }
    }

    void ShowHappyTouchFeedback() {
        static int64_t s_last_us = 0;
        constexpr int64_t kCooldownUs = 1200000;
        const int64_t now = esp_timer_get_time();
        if ((now - s_last_us) < kCooldownUs) {
            return;
        }
        s_last_us = now;
        ShowTemporaryEmotion("happy", 2000);
    }

    void PlayBatteryEmotion(const char* emotion, uint32_t duration_ms) {
#if CONFIG_USE_EMOTE_MESSAGE_STYLE
        if (display_ == nullptr || emotion == nullptr) {
            return;
        }
        if (display_->InsertAnimDialog(emotion, duration_ms)) {
            return;
        }
#endif
        ShowTemporaryEmotion(emotion, duration_ms);
    }

