maxjchuang/xiaozhi-esp32-music/main/boards/espressif/esp-vocat/esp_vocat.cc
    void StartLowBatteryAlertSequence() {
        constexpr int kMaxPlays = 3;
        constexpr int64_t kIntervalMs = 5 * 60 * 1000;

        low_battery_plays_left_ = kMaxPlays - 1;
        next_low_battery_play_ms_ = (esp_timer_get_time() / 1000) + kIntervalMs;
        PlayBatteryEmotion("low_battery", 4000);
    }

    void HandleBatteryEmotions() {
        if (charge_ == nullptr) {
            return;
        }

        const int level = charge_->GetBatteryLevel();
        const bool charging = charge_->IsCharging();

        if (charging && !was_charging_) {
            PlayBatteryEmotion("battery_connected", 4000);
            low_battery_alert_mask_ = 0;
            low_battery_plays_left_ = 0;
            next_low_battery_play_ms_ = 0;
        }
        was_charging_ = charging;

        if (charging) {
            return;
        }

        if (level > 12) {
            low_battery_alert_mask_ = 0;
            low_battery_plays_left_ = 0;
            next_low_battery_play_ms_ = 0;
            return;
        }

        const int64_t now_ms = esp_timer_get_time() / 1000;
        if (low_battery_plays_left_ > 0 && now_ms >= next_low_battery_play_ms_) {
            PlayBatteryEmotion("low_battery", 4000);
            low_battery_plays_left_--;
            if (low_battery_plays_left_ > 0) {
                next_low_battery_play_ms_ = now_ms + 5 * 60 * 1000;
            }
        }

        if (level <= 5 && (low_battery_alert_mask_ & 0x02) == 0) {
            low_battery_alert_mask_ |= 0x02;
            StartLowBatteryAlertSequence();
            return;
        }

        if (level <= 10 && (low_battery_alert_mask_ & 0x01) == 0) {
            low_battery_alert_mask_ |= 0x01;
            StartLowBatteryAlertSequence();
        }
    }

    static void battery_task(void* arg) {
        auto* self = static_cast<EspVocat*>(arg);
        while (true) {
            if (self != nullptr && self->charge_ != nullptr) {
                self->charge_->Update();
                self->HandleBatteryEmotions();
            }
            vTaskDelay(pdMS_TO_TICKS(300));
        }
    }

    static void imu_event_task(void* arg) {
        auto* self = static_cast<EspVocat*>(arg);
        if (self == nullptr || !self->bmi270_ready_) {
            vTaskDelete(NULL);
            return;
        }

        struct bmi2_sens_data prev = {};
        struct bmi2_sens_data cur = {};
        bool has_prev = false;
        int64_t last_shake_ms = 0;
        constexpr int kShakeDeltaThreshold = 20000;
        constexpr int64_t kShakeCooldownMs = 2000;

        while (true) {
            if (Bmi270Motion::ReadAccelRaw(cur)) {
                if (has_prev) {
                    int dx = abs(static_cast<int>(cur.acc.x) - static_cast<int>(prev.acc.x));
                    int dy = abs(static_cast<int>(cur.acc.y) - static_cast<int>(prev.acc.y));
                    int dz = abs(static_cast<int>(cur.acc.z) - static_cast<int>(prev.acc.z));
                    int shake_score = dx + dy + dz;

                    int64_t now_ms = esp_timer_get_time() / 1000;
                    if (shake_score > kShakeDeltaThreshold &&
                        (now_ms - last_shake_ms) > kShakeCooldownMs) {
                        last_shake_ms = now_ms;
                        // "dizzy/nauseated" are not guaranteed in current assets, use supported
                        // fallback.
                        self->ShowTemporaryEmotion("confused", 1800);
                    }
                }
                prev = cur;
                has_prev = true;
            }
            vTaskDelay(pdMS_TO_TICKS(80));
        }
    }

    void InitializeI2c() {
        i2c_config_t i2c_cfg = {
            .mode = I2C_MODE_MASTER,
            .sda_io_num = AUDIO_CODEC_I2C_SDA_PIN,
            .scl_io_num = AUDIO_CODEC_I2C_SCL_PIN,
            .sda_pullup_en = true,
            .scl_pullup_en = true,
            .master =
                {
                    .clk_speed = 400000,
                },
            .clk_flags = 0,
        };
        shared_i2c_bus_handle_ = i2c_bus_create(I2C_NUM_0, &i2c_cfg);
        if (!shared_i2c_bus_handle_) {
            ESP_LOGE(TAG, "Failed to create shared I2C bus");
            ESP_ERROR_CHECK(ESP_FAIL);
        }
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0) && !CONFIG_I2C_BUS_BACKWARD_CONFIG
        i2c_bus_ = i2c_bus_get_internal_bus_handle(shared_i2c_bus_handle_);
#else
#error "ESP-VoCat board requires i2c_bus_get_internal_bus_handle() support"
#endif
        if (!i2c_bus_) {
            ESP_LOGE(TAG, "Failed to get I2C master handle");
            ESP_ERROR_CHECK(ESP_FAIL);
        }

        temperature_sensor_config_t temp_sensor_config = TEMPERATURE_SENSOR_CONFIG_DEFAULT(10, 50);
        ESP_ERROR_CHECK(temperature_sensor_install(&temp_sensor_config, &temp_sensor));
        ESP_ERROR_CHECK(temperature_sensor_enable(temp_sensor));
    }
    // Switch the board-level pin variables from their V1.0 defaults to the
    // V1.2 layout. Must run on every boot that resolves to V1.2, including
    // the cached path: these globals start at the _1 values and GetAudioCodec()
    // reads them long after this function has returned.
    static void ApplyV12Pins() {
        AUDIO_I2S_GPIO_DIN = AUDIO_I2S_GPIO_DIN_2;
        AUDIO_CODEC_PA_PIN = AUDIO_CODEC_PA_PIN_2;
        QSPI_PIN_NUM_LCD_RST = QSPI_PIN_NUM_LCD_RST_2;
        TOUCH_PAD2 = TOUCH_PAD2_2;
        UART1_TX = UART1_TX_2;
        UART1_RX = UART1_RX_2;
    }

    uint8_t DetectPcbVersion() {
        // Pre-set the output latch before switching the pin to output mode:
        // after an external reset the latch defaults to 0, and driving 0 on
        // GPIO48 for even a moment cuts the codec rail on V1.2, after which
        // the first touch/fuel-gauge read aborts and the device reboots. On a
        // power-on reset we deliberately start at 0 so the probe below sees an
        // unpowered (and therefore silent) V1.2 codec.
        const esp_reset_reason_t reset_reason = esp_reset_reason();
        gpio_set_level(CORDEC_POWER_CTRL, reset_reason != ESP_RST_POWERON ? 1 : 0);
        gpio_config_t gpio_conf = {.pin_bit_mask = (1ULL << CORDEC_POWER_CTRL),
                                   .mode = GPIO_MODE_OUTPUT,
                                   .pull_up_en = GPIO_PULLUP_DISABLE,
                                   .pull_down_en = GPIO_PULLDOWN_DISABLE,
                                   .intr_type = GPIO_INTR_DISABLE};
        ESP_ERROR_CHECK(gpio_config(&gpio_conf));

        // After any reset other than a real power cycle the codec rail on
        // V1.2 keeps residual charge, so the "GPIO48 low" probe below sees a
        // false ACK from ES8311 and the board is misdetected as V1.0. GPIO48
        // then stays low, the codec loses power and mic/speaker die while the
        // screen keeps working; the unpowered chips also clamp the shared I2C
        // bus and the first fuel-gauge/touch read aborts, causing a reboot
        // loop (issue #1202). Only probe on a power-on reset; every other
        // reset reuses the cached result, and the GPIO output latch (kept
        // across soft resets) keeps the codec powered in the meantime.
        if (reset_reason != ESP_RST_POWERON && s_pcb_version_magic == kPcbVersionMagic &&
            s_pcb_version_cached <= 1) {
            if (s_pcb_version_cached == 1) {
                // V1.2: the codec rail is powered from GPIO48; make sure it stays
                // on and wait for the touch controller to answer, since reads
                // against a still-powering-up chip abort the whole system.
                ESP_ERROR_CHECK(gpio_set_level(CORDEC_POWER_CTRL, 1));
                for (int i = 0; i < 10; i++) {
                    if (i2c_master_probe(i2c_bus_, 0x15, 50) == ESP_OK) {
                        break;
                    }
                    vTaskDelay(pdMS_TO_TICKS(200));
                }
                ApplyV12Pins();
            }
            ESP_LOGI(TAG, "PCB version %s (cached, reset reason %d)",
                     s_pcb_version_cached ? "V1.2" : "V1.0", static_cast<int>(reset_reason));
            return s_pcb_version_cached;
        }

        ESP_ERROR_CHECK(gpio_set_level(CORDEC_POWER_CTRL, 0));
        vTaskDelay(pdMS_TO_TICKS(100));

